app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."limit_date" ASC
---
    def index
      @tasks = Task.order(:limit_date).all